<meta charset="utf-8">
<?php
/*$shuzu = [
    '家电'=>[
        '冰箱'=> ['单开', '双开', '三开'],
        '空调'=> ['1P', '2P', '3P'],
        '电视'=> ['32寸', '48寸', '50寸', '55寸'],
        '洗衣机'=> ['单桶', '滚筒', '双桶'],
        '热水器'=> ['电', '气', '太阳能']
    ],
    '服装' => [
'上衣'=> ['夹克','羽绒服','卫衣','毛衣','衬衫'],
'裤子'=> ['牛仔裤','皮裤','秋裤'],
'鞋子'=> ['运动鞋','休闲鞋','皮鞋', '靴子',],
'裙子'=> ['短裙','长裙','连衣裙']
],
    ];
    foreach ($shuzu as $key => $value){     // 循环整个数组
        if(is_array($value)){               //判断大数组里的值是不是一个数组
            foreach ($value as $k => $a){    //  如果是的话,循环大数组里的值
                if($k == '裤子'){            //  如果是裤子
                    $s = $a ;           //吧裤子的值,赋值给$a
                    print_r($a);       //打印$a;
                }
            }
        }

        }*/
$sz = [
    '家电'=>[
        '冰箱'=> ['单开', '双开', '三开'],
        '空调'=> ['1P', '2P', '3P'],
        '电视'=> ['32寸', '48寸', '50寸', '55寸'],
        '洗衣机'=> ['单桶', '滚筒', '双桶'],
        '热水器'=> ['电', '气', '太阳能']
    ],
    '服装' => [
        '上衣'=> ['夹克','羽绒服','卫衣','毛衣','衬衫'],
        '裤子'=> ['牛仔裤','皮裤','秋裤'],
        '鞋子'=> ['运动鞋','休闲鞋','皮鞋', '靴子',],
        '裙子'=> ['短裙','长裙','连衣裙']
    ],
];

     foreach ($sz as $key => $value){
         if(is_array($value)){
             foreach ($value as $k=> $v){
                 if($k == '空调'){
                     $c = $v;
                     print_r($c);
                 }
             }
         }
     }




/*for ($i=1;$i<=9;$i++) {
    for ($s = 1; $s <= $i; $s++) {
        echo $s.'*'.$i.'='.$i*$s.'&nbsp;&nbsp;';
     if($i*$s<10){
         echo " ";
     }
      }
     echo '<br>';
}

$jzt = '*';
   for($d=1;$d<=30;$d++){
       echo "<div style='text-align: center';>".$jzt."</div>";
       echo '<br>';
       $jzt=$jzt.'*';
   }*/




?>